* basic ~rand~ bloack

#+begin_src clojure
(rand 10)
#+end_src

#+RESULTS:
: 0.6596483119854857

* use a "session" argument?


avoid "*cider-repl .emacs.d/twentysix:localhost:60654(clj)*"
#+begin_src clojure :session mysession
(def session-randy (rand 10))
#+end_src

#+RESULTS:
: #'user/session-randy

#+BEGIN_SRC clojure :session mysession
randy

#+END_SRC

#+RESULTS:
: 2.266556465207401

#+BEGIN_SRC clojure
session-randy
#+END_SRC

#+RESULTS:
: 6.903699129093686

* clojure block "dir" value for writing

really want to write outside the current repo?

Doesn't seem to work to pass the "dir" value.


#+begin_src clojure :results value :var dir="/Users/li/repos/testing-clj/"
(spit (str dir "test.txt") (rand))
#+end_src

#+RESULTS:
: class java.io.FileNotFoundException

#+begin_src clojure :results value :var dir="/Users/oi/repos/testing-clj/"
(spit (str dir "test.txt") (rand))
#+end_src

#+RESULTS:
: class java.io.FileNotFoundException

#+begin_src clojure
(spit (str dir "test.txt") (rand))
#+end_src

#+RESULTS:
: class clojure.lang.Compiler$CompilerException

** an instrument
#+BEGIN_SRC clojure
(definst noisey1 [] (sin-osc (* 0.5 (+ (* 900 (lf-brown-noise0:kr 20)) (* (* 100 (lf-brown-noise0:kr 1)) (lf-clip-noise 2))))))
#+END_SRC

#+RESULTS:
: class clojure.lang.Compiler$CompilerException

#+begin_src clojure
(noisey1)
#+end_src

#+RESULTS:
: #<synth-node[loading]: user/noisey1 51>

YIKES!
#+begin_src clojure
(demo 10 (sin-osc (abs  (* 10000 (brown-noise:kr)))))
#+end_src


* 
#+BEGIN_SRC clojure
(definst noisey2 [attack 0.01 sustain 0.4 release 0.1 vol 0.4 length 3] 
  (* (env-gen (lin attack sustain release) 1 1 0 length FREE)
     (pink-noise) ; also have (white-noise) and others...
     vol))

(noisey2)
#+END_SRC

#+RESULTS:
: #<instrument: noisey2>#<synth-node[loading]: user/noisey2 43>
